Repository: CofficLab/Lumi
Catalog: Plugins/DatabaseManagerPlugin/Sources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk, zh_tw

source: Add Connection
zh_hans: 添加连接
zh_hk: 添加連接
zh_tw: 添加連線

source: Browse and inspect database tables and records
zh_hans: 浏览和检查数据库表及记录
zh_hk: 瀏覽和檢查資料庫表及記錄
zh_tw: 瀏覽和檢查資料庫表及記錄

source: Browse available databases and tables
zh_hans: 浏览可用数据库和表
zh_hk: 瀏覽可用資料庫和表
zh_tw: 瀏覽可用資料庫和表

source: Configure database connections in settings
zh_hans: 在设置中配置数据库连接
zh_hk: 在設定中設定資料庫連線
zh_tw: 在設定中設定資料庫連線

source: Connect to SQLite, MySQL, PostgreSQL, and Redis databases
zh_hans: 连接 SQLite、MySQL、PostgreSQL 和 Redis 数据库
zh_hk: 連接 SQLite、MySQL、PostgreSQL 和 Redis 資料庫
zh_tw: 連接 SQLite、MySQL、PostgreSQL 和 Redis 資料庫

source: Connections
zh_hans: 连接
zh_hk: 連接
zh_tw: 連線

source: Copy
zh_hans: 复制
zh_hk: 複製
zh_tw: 複製

source: Data Browser
zh_hans: 数据浏览器
zh_hk: 資料瀏覽器
zh_tw: 資料瀏覽器

source: Database
zh_hans: 数据库
zh_hk: 資料庫
zh_tw: 資料庫

source: Database Type
zh_hans: 数据库类型
zh_hk: 資料庫類型
zh_tw: 資料庫類型

source: Enable connection pooling for better performance
zh_hans: 启用连接池以提升性能
zh_hk: 啟用連線池以提升效能
zh_tw: 啟用連線池以提升效能

source: Execute queries and view results
zh_hans: 执行查询并查看结果
zh_hk: 執行查詢並查看結果
zh_tw: 執行查詢並查看結果

source: Export data in various formats
zh_hans: 以多种格式导出数据
zh_hk: 以多種格式匯出資料
zh_tw: 以多種格式匯出資料

source: Keys
zh_hans: 键
zh_hk: 鍵
zh_tw: 鍵

source: Manage SQLite, MySQL, PostgreSQL, and Redis
zh_hans: 管理 SQLite、MySQL、PostgreSQL 和 Redis
zh_hk: 管理 SQLite、MySQL、PostgreSQL 及 Redis
zh_tw: 管理 SQLite、MySQL、PostgreSQL 及 Redis

source: Multi-Database Support
zh_hans: 多数据库支持
zh_hk: 多資料庫支援
zh_tw: 多資料庫支援

source: No results
zh_hans: 无结果
zh_hk: 無結果
zh_tw: 無結果

source: Query Editor
zh_hans: 查询编辑器
zh_hk: 查詢編輯器
zh_tw: 查詢編輯器

source: Save frequently used queries as snippets
zh_hans: 将常用查询保存为片段
zh_hk: 將常用查詢儲存為片段
zh_tw: 將常用查詢儲存為片段

source: Schema Inspector
zh_hans: 结构检查器
zh_hk: 結構檢查器
zh_tw: 結構檢查器

source: Select a database to connect
zh_hans: 选择一个数据库进行连接
zh_hk: 選擇一個資料庫進行連接
zh_tw: 選擇一個資料庫進行連線

source: Tables
zh_hans: 表
zh_hk: 表
zh_tw: 表

source: Use read-only mode for production databases
zh_hans: 对生产数据库使用只读模式
zh_hk: 對生產資料庫使用唯讀模式
zh_tw: 對生產資料庫使用唯讀模式

source: View database schema, indexes, and relationships
zh_hans: 查看数据库结构、索引和关系
zh_hk: 查看資料庫結構、索引和關聯
zh_tw: 查看資料庫結構、索引和關聯

source: Write and execute SQL queries with syntax highlighting
zh_hans: 编写并执行带语法高亮的 SQL 查询
zh_hk: 編寫並執行帶語法醒目提示的 SQL 查詢
zh_tw: 編寫並執行帶語法醒目提示的 SQL 查詢
